{
  "sessions": [
    {
      "id": "2586b5d4-fa15-4955-9991-be672b6b52c2",
      "title": "Registration by QCI & Breakfast by Zirous",
      "description": "Stop in and get your badge and lanyard, and let us know you're here!",
      "startsAt": "2024-10-26T09:00:00",
      "endsAt": "2024-10-26T09:30:00",
      "isServiceSession": true,
      "isPlenumSession": false,
      "speakers": [],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54943,
      "liveUrl": null,
      "recordingUrl": null,
      "status": null,
      "isInformed": false,
      "isConfirmed": false
    },
    {
      "id": "be5d58d9-bf52-41c0-8718-c39501083a73",
      "title": "Opening Session",
      "description": "Opening Session",
      "startsAt": "2024-10-26T09:30:00",
      "endsAt": "2024-10-26T09:50:00",
      "isServiceSession": true,
      "isPlenumSession": true,
      "speakers": [],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51536,
      "liveUrl": null,
      "recordingUrl": null,
      "status": null,
      "isInformed": false,
      "isConfirmed": false
    },
    {
      "id": "751880",
      "title": "What They Don't Teach You in Programming Class",
      "description": "As a friend of mine always says, \"Technology is easy; people are hard.\" As important as it is to grow your technical skills, it is vitally important to also nurture your personal skills.\r\n\r\nIn this session we will dive into the \"soft\" skills that are often harder than the complex technology we work with every day, using scientific studies and actual case stories where knowing the technology wasn't enough, backed by 15 years of experience in consulting, working with dozens of clients and technologies, and hundreds of individuals from developers to C-Suite executives.",
      "startsAt": "2024-10-26T10:00:00",
      "endsAt": "2024-10-26T11:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2ef2a9a7-1ab0-441c-bde7-fa73b04e9af4"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51536,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "750804",
      "title": "Architectural Best Practices in Building AI SaaS Apps on AWS",
      "description": "In 2024, there are multiple ways that your next big money-making idea can get off the ground. However, choosing the right tools upfront means being able to add features sooner and make your customers even happier.\r\n\r\nIn this interactive session, we'll explore what it takes to build a modern fullstack serverless application on AWS that uses generative AI. We'll then iterate on the the approach by introducing new features and services based on real-world scenarios from actual AWS customers.",
      "startsAt": "2024-10-26T10:00:00",
      "endsAt": "2024-10-26T11:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c032ce0e-73a9-445b-a42d-a674d6912262"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51537,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "725451",
      "title": ".NET Aspire: Not just for cloud native distributed systems",
      "description": "You may have heard about this thing called .NET Aspire, and you've been told it's only for cloud native distributed systems and microservices. Did you know that's not the case? .NET Aspire brings value to any application whether it's a single majestic monolith running on-premises or an application with thousands of microservices running in the cloud.\r\n\r\nIn this talk, we'll break down Aspire from the ground up. We won't be creating an Aspire project that pre-wires everything up for you. We'll start with an empty project and then add on the Aspire bits so you can see how this works under the hood. We'll set up the app host, the service defaults, various Aspire components, and of course the fancy dashboard.\r\n\r\nBy the end of this talk, you'll not only have a better understanding of what Aspire is and how it works, but you'll also realize that every application should be using Aspire today, not just cloud native distributed applications.",
      "startsAt": "2024-10-26T10:00:00",
      "endsAt": "2024-10-26T11:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8f9f5411-8e27-4c2f-bc01-fc682342c44c"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51538,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "749675",
      "title": "Beyond Code: Mastering Collaboration and Leadership in Software Development",
      "description": "Great software development isn’t just about writing flawless code—it’s about building strong teams, fostering collaboration, and navigating change with agility. In this workshop, we’ll dive into the principles of Adaptive Leadership, equipping you with the tools to be not just a great coder, but a powerful team player and leader. Through a mix of theory and hands-on exercises, you’ll learn how to tackle deep-seated challenges, foster innovation, and lead your team through the complexities of today's ever-evolving development landscape.\r\n\r\nLearning Objectives:\r\n\r\nIdentify and Address Challenges Beyond Code.\r\nLearn to spot and address adaptive challenges within your team using strategies like \"Getting on the Balcony\" and \"Identifying the Adaptive Challenge.\"\r\n\r\nFoster a Culture of Innovation and Inclusion.\r\nUnderstand how to give ownership back to your team, leveraging diverse perspectives to create an environment that encourages experimentation and fresh ideas.\r\n\r\nLead Through Change with Confidence.\r\nBuild the skills to maintain focus, regulate stress, and navigate uncertainty, ensuring that your team stays resilient and adaptable in the face of change.",
      "startsAt": "2024-10-26T10:00:00",
      "endsAt": "2024-10-26T11:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "7867d515-dfea-4c6b-a113-b08481237c01"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54860,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "746017",
      "title": "Mastering Multi-Cloud Strategies for Enhanced Cost Efficiency and Operational Resilience",
      "description": "As cloud adoption continues to surge, with global spending projected to hit $597.3 billion by 2023, leveraging multi-cloud environments has become essential for businesses aiming to optimize costs and boost operational efficiency. With 89% of enterprises now utilizing multi-cloud strategies, this approach offers a strategic advantage in reducing vendor lock-in, accessing diverse services, and achieving significant financial savings.\r\n\r\nIn this session, we will explore the nuances of multi-cloud implementation, focusing on how to strategically optimize workloads, leverage a diverse array of cloud services, and select the right instance types to maximize cost savings. By presenting data from leading industry reports, we will illustrate how organizations employing multi-cloud strategies have achieved an average of 15% reduction in cloud expenditures and a 93% decrease in unplanned downtime.\r\n\r\nParticipants will learn how to effectively distribute workloads based on performance and cost criteria, utilize various cloud providers to cut costs by up to 90% through spot instances, and enhance system resilience through geographic diversity and redundancy. Additionally, the presentation will emphasize the importance of ongoing benchmarking to ensure real-time cost and performance optimization, offering insights into improving negotiation leverage and refining cloud infrastructure.\r\n\r\nWe will also address common challenges in multi-cloud management, including complexity, data transfer costs, and governance issues, and provide practical solutions such as advanced management tools and standardized processes. Attendees will leave with actionable strategies to develop cost-effective, resilient, and scalable multi-cloud architectures, paving the way for sustained operational success.\r\n\r\n",
      "startsAt": "2024-10-26T10:00:00",
      "endsAt": "2024-10-26T11:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8f19f63e-982b-477c-bcbe-16e99497d8ff"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54862,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": false
    },
    {
      "id": "741132",
      "title": "Common Sense Architecture Planning",
      "description": "The Agile Manifesto says \"Working Software over Comprehensive Documentation\", not \"Do No Documentation\".\r\nLet's talk about how some simple architecture documentation can help bring clarity and consistency to a project.\r\n\r\n1. Let's describe the problem\r\n2. Team size and maturity matters\r\n3. Who, What, and Why?\r\n4. Guides, not Instructions\r\n5. Walkthrough of implementation example with C4 and IcePanel\r\n6. Wrap up and Questions\r\n",
      "startsAt": "2024-10-26T10:00:00",
      "endsAt": "2024-10-26T11:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "faa420ba-d649-4c20-a5ee-ec6586987b64"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54863,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "734320",
      "title": "Leveraging RAG in Large Organizations",
      "description": "In today's fast-paced digital landscape, large organizations are constantly seeking innovative solutions to streamline workflows, enhance productivity, and deliver exceptional user experiences. Retrieval-Augmented Generation (RAG) emerges as a transformative approach that combines natural language understanding and generation models.\r\n\r\nThis talk dives into the realm of RAG, offering a comprehensive exploration of its principles, applications, and implications within organizational contexts. Attendees will gain insights into how RAG can revolutionize knowledge management, decision-making processes, and user interactions. Through real-world case studies and best practices, this presentation equips attendees with actionable strategies for implementing and maximizing the potential of RAG within their organizations.\r\n\r\nJoin us as we uncover the untapped opportunities and navigate the challenges of integrating RAG into the fabric of large organizations, paving the way for unparalleled innovation and efficiency in the digital era",
      "startsAt": "2024-10-26T10:00:00",
      "endsAt": "2024-10-26T11:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f325ad0b-4ed5-4be4-83b5-63132f3332b9"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54864,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "2d6b75b4-545b-4747-8fbf-f395cd44122f",
      "title": "Break",
      "description": "Refreshments available in the Atrium",
      "startsAt": "2024-10-26T11:00:00",
      "endsAt": "2024-10-26T11:15:00",
      "isServiceSession": true,
      "isPlenumSession": true,
      "speakers": [],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54943,
      "liveUrl": null,
      "recordingUrl": null,
      "status": null,
      "isInformed": false,
      "isConfirmed": false
    },
    {
      "id": "726384",
      "title": "Revolutionizing Communication: Mastering Two-Way Text Messaging Application Interactions",
      "description": "In today's constantly connected, always available world, effective communication is paramount for businesses and organizations to thrive. Two-way text messaging applications have emerged as powerful tools to facilitate real-time, personalized, and interactive conversations with customers, clients, and stakeholders. This conference session aims to delve deep into the world of implementing these interactions and unlocking their potential for enhancing engagement, customer satisfaction, and operational efficiency.\r\n\r\nThis session will explore not only the technical how of implementation but will also explore the personal, legal, and emotional considerations regarding the proper application architecture to ensure that a truly effective communication strategy can be realized.\r\n\r\nWith an example application at hand, the session will explore feature enablement, user experience expectations, feature support, and regulatory impacts of SMS messaging implementation projects.\r\n\r\nAttendees will leave with the tools and insights to create their own solutions within their apps to better service customers in a manner that is repeatable, reliable, and relatable to a wide variety of users.",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a9011c65-6287-4529-ac91-56a8b9daa9a9"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51536,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "745828",
      "title": "Using GenAI to Turn Unstructured Data into Structured Data",
      "description": "Do you have unstructured data sitting around that you can't get value out of? Let's turn it into something useful!  Learn how to navigate pesky mixed-media pdfs and use few shot prompting with images to improve data accuracy.",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "bdc3c162-02ab-4e2b-a39b-00842eca922e"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51537,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "729003",
      "title": "Advanced .NET Testing With In Memory EF and Hosted APIs",
      "description": "Do you want to test all of your Entity Framework queries without setting up a test database? Do you want to test your API without leaving Visual Studio? Do you want to add integration tests to your CI build without adding another library? Do you want to \"cheat\" and hit 95%+ code coverage? In this talk, I will walk through using the WebApplicationFactory (Microsoft.AspNetCore.Mvc.Testing) library to spin up your API in memory. I will then show how to add an in-memory data connection. Finally, I will pull it all together and show a full integration test.",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8f39cbc1-7221-4c5e-a7e3-461e9e2a861d"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51538,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "742274",
      "title": "Code Your Career: Debugging The Job Search with Strategy",
      "description": "Everyone finds themselves in the position of looking for a job at some point in their career.   The key is being ready, which should start before you are looking.  This talk will equip you with practical tips from your resume/LinkedIn, what to do along your career to help you tell your story, interviewing pointers, the compensation conversation, and what employers look for when they turn outside to hire leaders and senior engineers. I'll also shoot straight about the strategic use of third-party recruiters - when and, more importantly, when you should NOT use one. You do not need to actively look for a role to find value in this conversation.   My goal is to give engineers a streamlined approach so that when the time comes, they are prepared and it's a positive experience.  ",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "5cf66ded-35a5-4a1e-b6ac-eeefd78749fb"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54860,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "762313",
      "title": "Full-Stack Web Development with Asp.NET Core Blazor",
      "description": "Developers who love strongly typed languages like C# but also see the value of rich interactive web applications can now \"have it all\" with Asp.NET Core Blazor! Blazor is a component-based, reactive framework that builds on top of modern .NET, Razor syntax, HTML, and CSS, to create a single-language full-stack application. Components can be statically generated on the server, be live-updated from the server via WebSockets, or run in the client browser just like a JavaScript SPA application.\r\n\r\nIn this session, we will learn how to get started with Blazor, as well as some advanced tips and tricks.",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b1bd4d43-a244-4aab-95bb-92bcaf427ee4"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54861,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "725381",
      "title": "The Journey For Zero Downtime Deployments In Azure",
      "description": "Zero downtime deployments is just something people talk about but never actually do, right? Wrong! In this presentation, Mike will highlight the building blocks to enable zero downtime deployments for an ASP.NET application in Azure. He will discuss several dev team practices that contribute to pain-free deployments. He will show patterns in GitHub Actions for deployments. We will touch on using Bicep for Infrastructure As Code, as well as methods for performing database migrations. After this presentation, you should have all the tools you need to improve your deployment process.",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "1469bb32-408e-40f2-8c5b-707097144b32"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54862,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "744833",
      "title": "Abstract your back-end with GraphQL",
      "description": "Do you have a lot of BFFs (Back-end for Front-end) that you are maintaining for your front-end applications?  Do your front-end applications require a lot of disparate calls to different services?  Is your front end having to deal with multiple security models to appease back-end requirements?  Are you in the process of modernizing your back-end and need a way to abstract the migration from consumers?\r\n\r\nThis session will include live coding to demonstrate building a federated graphQL schema using disparate technologies and data stores.   Furthermore, it will show how a front end can call that graphQL instance using one security model and pull back data from those sources.  Finally, we will switch out one of the back-end services and show how the consumer doesn't need to make any changes.\r\n\r\nAttendees to this session will learn the following items.  \r\nWhat is a graphQL query?\r\nWhat is a graphQL mutation?  \r\nWhat are subgraphs? \r\nWhat is a supergraph?\r\nHow do all these items fit together?\r\nHow does security work?\r\nHow do consumers interact with graphQL?",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "e775a168-09a5-4c35-8acc-8a5c995833e1"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54863,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "741880",
      "title": "Effortless AR/VR/MR Development: Building Immersive Experiences for the Metaverse",
      "description": "As the Metaverse evolves, the demand for immersive experiences through Augmented Reality (AR), Virtual Reality (VR), and Mixed Reality (MR) is growing rapidly. However, developing these experiences can often seem complex and overwhelming. This session is designed to demystify the process, offering practical insights and techniques for building AR/VR/MR applications with ease.\r\n\r\nWe'll explore the foundational principles of AR, VR, and MR, and provide a clear roadmap for creating engaging, high-quality immersive environments. Whether you’re new to the field or looking to refine your skills, this session will equip you with the essential knowledge and strategies to bring your Metaverse projects to life, making the development process more accessible and manageable.",
      "startsAt": "2024-10-26T11:15:00",
      "endsAt": "2024-10-26T12:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2e1fff2d-99b3-4225-943a-41135cd2d51c",
        "683ab952-4c52-4716-85d8-d4c92abb32c9"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54864,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "21174c33-37a4-41d6-80c9-33455277a45d",
      "title": "Lunch",
      "description": "Lunch",
      "startsAt": "2024-10-26T12:15:00",
      "endsAt": "2024-10-26T13:00:00",
      "isServiceSession": true,
      "isPlenumSession": false,
      "speakers": [],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54943,
      "liveUrl": null,
      "recordingUrl": null,
      "status": null,
      "isInformed": false,
      "isConfirmed": false
    },
    {
      "id": "725453",
      "title": "Safely Evolving Legacy Code",
      "description": "A new ticket comes in. It's for \"that app.\" You know the one. The one nobody wants to touch, because the code is a mess and yet the application is business critical. In this talk, the fancy technologies will be put to the side, and instead the the reality most people live in will be acknowledged. You'll learn how we can evolve legacy code from the state it's in today to the value we need to get from it tomorrow",
      "startsAt": "2024-10-26T13:00:00",
      "endsAt": "2024-10-26T14:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8f9f5411-8e27-4c2f-bc01-fc682342c44c"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51536,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "727187",
      "title": "Leveraging LLMs with Spring AI",
      "description": "In 2024, it’s hard to find an application that isn’t enhanced with some form of AI capabilities. If you’re curious about the AI buzz but unsure how to integrate it seamlessly with your existing Spring applications, this session is for you. We’ll explore essential AI terminology and create a Spring-based application that easily integrates with various Large Language Models, such as OpenAI’s GPT-4. Time permitting, we’ll demonstrate creating effective prompts, utilizing OpenAI’s function calling, and implementing Retrieval Augmented Generation (RAG).\r\n",
      "startsAt": "2024-10-26T13:00:00",
      "endsAt": "2024-10-26T14:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "848de13d-1c85-4fbf-b627-1c94b80fafa1"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51537,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "737426",
      "title": "Analyzing Code in .NET",
      "description": "We all want to have someone else review our C# code to make sure it's written well. Wouldn't it be even better if we can have that review process done automatically? In this session, you'll see how you can use static analysis tools to find all kinds of implementation issues before they show up in a release. You'll also see how you can create your own analyzers to hunt down problematic areas in code.",
      "startsAt": "2024-10-26T13:00:00",
      "endsAt": "2024-10-26T14:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8723a815-476d-41b4-bed8-c5d2b046bb9e"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51538,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "760604",
      "title": "Fishbowl Conversation",
      "description": "Come discuss software topics with others, moderated by the Iowa Code Camp leadership. The advantage of fishbowl is that it allows the entire group to participate in a conversation. Several people can join the discussion.",
      "startsAt": "2024-10-26T13:00:00",
      "endsAt": "2024-10-26T14:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0b5eb7a9-187c-4b74-bfea-010c18b414f4"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54860,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "737186",
      "title": "Protecting Your Secrets using Azure Key Vault, Azure App Configuration, GitHub, and C# MVC",
      "description": "Your team has been working well for a long time, but developers keep checking in the connection strings to Azure Services (like SQL Databases and Storage).  You know that once you check in a secret it should be considered compromised so you've built a robust rotation strategy and you are ready to move forward, but you want to solve the real problem, which is preventing the team from checking in (and even knowing) what your secrets are.  Another problem that you noticed is that Application Insights and your users are logging sensitive information that needs to be sanitized.\r\n\r\nIn this session you will learn how to get notifications when users have checked in secrets using GitHub and third-party tools.  You'll also see how to leverage secrets in your code without having to know the secrets, both locally and at Azure via the Azure Key Vault.  \r\n\r\nYou will then learn how to leverage secrets that need to be shared to Azure App Configuration and have the ability to use them from your local and Azure environments.\r\n\r\nTo complete the journey, you will then learn how to capture output before committing to your logs (or app insights) with a few simple code changes to make sure that sensitive information is sanitized before being permanently recorded.",
      "startsAt": "2024-10-26T13:00:00",
      "endsAt": "2024-10-26T14:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0c4f74c9-6be8-40d0-b588-674d3b783472"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54862,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "771289",
      "title": "Capture the Flag",
      "description": "We’re not talking about the outdoor game where you are trying to steal a physical flag and bring it back to your base, this capture the flag is a series of computer security challenges you solve to retrieve a flag and get points!  Solving these challenges require various skills including decrypting content, SQL Injection, reverse engineering and more.  Learn about how capture the flag works, where you find challenges/competitions, and some techniques required to solve them.  I went from never having tried one to winning a competition the next year.  The challenges are not only interesting, they helped change my perspective about how web sites are attacked and how I could better protect them.  ",
      "startsAt": "2024-10-26T13:00:00",
      "endsAt": "2024-10-26T14:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "797d42f4-b284-45e7-b400-3f402b151e8b"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54863,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "751594",
      "title": "I Hope I'm Not the Smartest Person in the Room",
      "description": "Join us as we explore the transformative potential of diverse perspectives, collaboration, and the wisdom of crowds. In this engaging talk, we'll dive into the benefits of surrounding ourselves with people who possess different skills, experiences, and knowledge. We'll examine how embracing intellectual humility and being open to learning from others can lead to groundbreaking insights and innovative solutions.\r\nBy the end of this talk, you'll be inspired to embrace intellectual humility, appreciate the wealth of knowledge that surrounds you, and understand the true power of collaboration in our ever-evolving world.",
      "startsAt": "2024-10-26T13:00:00",
      "endsAt": "2024-10-26T14:00:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0cfc4167-0700-4bd3-9fa0-96bdbe335c3a"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54864,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "6202e073-de27-4ec1-8b12-dfe9d160ea1c",
      "title": "Break",
      "description": "Refreshments available in the Atrium",
      "startsAt": "2024-10-26T14:00:00",
      "endsAt": "2024-10-26T14:15:00",
      "isServiceSession": true,
      "isPlenumSession": true,
      "speakers": [],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54943,
      "liveUrl": null,
      "recordingUrl": null,
      "status": null,
      "isInformed": false,
      "isConfirmed": false
    },
    {
      "id": "729456",
      "title": "Sphere of Control: Techniques to Tackle Tech Debt Today",
      "description": "Between aggressive deadlines and mounting Tech Debt, teams often feel helpless .  They struggle to deliver high quality solutions they are proud of which also delight their users.\r\nSometimes leaders can't help them.\r\nTeams recognize the origins of the mess but often grapple to break free.\r\n\r\nThankfully there are tried and true tactics to tackle the tech debt  troubles, Today!  You don't need a dramatic dedicated deconstruction department.  You and your team can solve this yourselves!\r\n\r\nLearn technical, political, and procedural techniques to create more joy in the new work with less pain from the old.",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a44c7b35-83ea-48a8-a305-fcfa160d5b76"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51536,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "745826",
      "title": "Introduction to GenAI Agentic Workflows",
      "description": "You've heard about advanced prompt engineering and Retrieval Augmented Generation (RAG), but now, all the cool kids are talking about \"Function Calling\" and \"Agentic Workflows\". What does that mean?  Here we talk about different aspects of agentic workflows and walk through a very simple example you can use with any model you want.",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "bdc3c162-02ab-4e2b-a39b-00842eca922e"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51537,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "734321",
      "title": "Automating Code Refactoring with OpenRewrite",
      "description": "In this presentation, we will explore the powerful capabilities of OpenRewrite, a cutting-edge tool for automating code refactoring and modernization across various programming languages. Attendees will gain insights into how OpenRewrite can streamline large-scale code transformations, enforce best practices, and improve code quality with minimal manual intervention. We'll dive into real-world use cases, demonstrate how to create custom recipes, and discuss best practices for integrating OpenRewrite into your development workflow. Whether you're a developer, architect, or tech lead, this session will equip you with the knowledge to harness OpenRewrite for more efficient and effective code management.",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f325ad0b-4ed5-4be4-83b5-63132f3332b9"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51538,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "770421",
      "title": "Which IAC is right for me",
      "description": "You’re in the cloud or you’re about to move and you’ve heard about this Infrastructure As Code (IAC) thing. As you start to dive in you realize you’re overwhelmed with options. Terraform? CloudFormation? CDK? Pulumi? Bicep? ARM? Which do I pick?\r\n\r\nIn this talk we’ll demystify what IAC is, why you should be doing it if you aren’t already, give some pros and cons of all the different options out there, and then show real live demos of IAC in action to compare the approaches. You'll also see how to integrate DevSecOps into your pipelines to prevent cloud misconfigurations.\r\n\r\nIf you feel iffy about IAC or cloud configuration in general, this talk is for you.",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b0d25d6a-4236-44a5-8e9f-6e21b6e1a429"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54860,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "763512",
      "title": "Lightning Talks",
      "description": "A lightning talk is a very short presentation lasting only a few minutes sharing a technical topic of interest. Come share with others!",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0b5eb7a9-187c-4b74-bfea-010c18b414f4"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54861,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "741885",
      "title": "Mastering Phi SLM and Fine-Tuning: Building Custom AI Solutions for Your Applications",
      "description": "As AI technology advances, the need for highly efficient and customizable models has never been greater. This session delves into the world of Phi SLM (Small Language Models) and the art of fine-tuning, offering a comprehensive guide to building custom AI solutions tailored to your unique applications. \r\n\r\nJoin us to uncover the fundamentals of Phi SLM, a powerful approach for creating efficient, interpretable models. Discover how fine-tuning can further optimize pre-trained models, enhancing their performance for specialized tasks. By the end of this session, you'll be equipped with the knowledge and tools to harness the power of Phi SLM and fine-tuning, enabling you to develop AI solutions that are not only robust but also precisely aligned with your application’s unique requirements.",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2e1fff2d-99b3-4225-943a-41135cd2d51c",
        "683ab952-4c52-4716-85d8-d4c92abb32c9"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54862,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "728760",
      "title": "Reverse Engineering and Application Development",
      "description": "Question: is it possible to introduce new features and provide bug fixes for an application once the source code is lost?\r\n\r\nMost of the time, when approached with this scenario, organizations resort to a very expensive rewrite project.  What happens though, if the legacy application just needs 10-20 bug fixes and it otherwise sufficient for the time being?  \r\n\r\nAdvances in reverse engineering over the last few years have made binary patching and modification much easier than in the past.  Even for bytecode-based languages, such as C# (CLR) and Java (JVM), new tools allow for analyzing and even modifying existing programs, without the source code, without even recompiling!\r\n\r\nNow bugfixes are just an example of the approach, but there is no reason to stop there! Here's a scenario; your business relies on an ancient 3rd party WinForm app for critical business processes; using reverse engineering and binary patching, there is nothing prohibiting you from introducing a REST API on top of the old application, thereby increasing the shelf life of the \"legacy\" software.",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "1cacbbcc-84f5-4add-96b9-eee5449db9ca"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54863,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "747792",
      "title": "Cryptography 101",
      "description": "Learn the fundamentals of cryptography, including public/private and symmetric encryption, hashing, and digital signatures.  Discover which techniques are appropriate for various situations.  Review practical real life examples for storing passwords, protecting URL parameters, securely exchanging information with partners, and safely encrypting sensitive information on public web sites.  Concepts apply to all platforms, examples will be in C# and .NET    \r\n",
      "startsAt": "2024-10-26T14:15:00",
      "endsAt": "2024-10-26T15:15:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "797d42f4-b284-45e7-b400-3f402b151e8b"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54864,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "ee2450df-d5ba-4186-a81b-dd4e9a5981f8",
      "title": "Break",
      "description": "Refreshments available in the Atrium",
      "startsAt": "2024-10-26T15:15:00",
      "endsAt": "2024-10-26T15:30:00",
      "isServiceSession": true,
      "isPlenumSession": true,
      "speakers": [],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54943,
      "liveUrl": null,
      "recordingUrl": null,
      "status": null,
      "isInformed": false,
      "isConfirmed": false
    },
    {
      "id": "728119",
      "title": "Using the Wisdom of the Ancients to Improve Code",
      "description": "Picasso said, \"Learn the rules like a pro, so you can break them like an artist.\"  In this talk, Judah De Paula PhD, will draw upon over two decades of industry experience to discuss some of his favorite rules for writing software and explain why the rules sometimes work better in theory than in practice.  For example, one must accept you suck as a programmer before you can be good at it.  If you think there is something Zen in that, he does too.  Concrete examples will be mixed with theoretical principles to inspire you to think of your daily routine in new ways.\r\n\r\nCode will be in C# and Python.  You might be briefly forced to learn about Pascal the programming language and Pascal the man.",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "21c089b2-3d1a-46a7-a6e5-c9cb394ec78f"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51536,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "734769",
      "title": "Does it Matter How you Give Feedback?",
      "description": "Good feedback has the power to improve performance, increase team engagement, and lead to higher quality products. The ability to deliver feedback is an essential skill for high performing teams. Good feedback is clear and delivered in a way that preserves working relationships. This talk will explore key elements to include in good feedback and leave attendees able to more confidently and effectively communicate both positive and constructive thoughts to their teammates.\r\n\r\nWe’ve all been in a situation where we want to give feedback but are struggling to find the best way to do it. Maybe a coworker said something in a meeting that undermined your credibility or a teammate is consistently delivering late or low quality work. How do you address the situation in a way that preserves your working relationship, but still solves the issue? Giving feedback can feel awkward. What do I say? Am I going to hurt their feelings?\r\n\r\nWe will explore methods for giving well crafted feedback that make sharing your observations with a teammate feel less daunting and lead to more productive team dynamics.",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b8f6af91-31e0-48b7-bbdd-850124972b07"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51537,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "737425",
      "title": "Using Source Generators for Fun (and Maybe Profit)",
      "description": "One of the features added in C# 9 is called \"source generators\", enabling a developer to create new code at compile time. This can be used for a myriad of cases, such as optimization, automating repetitive code, and dynamic API creation. In this session, I'll cover how source generators work and demonstrate a number of implementations.",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8723a815-476d-41b4-bed8-c5d2b046bb9e"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51538,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "750848",
      "title": "Black Boxes and AI Tools",
      "description": "I would like to cover the importance behind using tools, frameworks, and libraries as black boxes, but making sure that you open the hood and understand what is going on underneath. So often, a lack of deeper understanding about third party code can lead to issues. Performance, security, and just your general approach to development can be improved if you take the time to understand the inner workings of what you are using. Some real world examples will be provided from my experience in the industry and plenty of time for discussion and questions.",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a5afc603-5cf5-4828-85c4-082b4ffddc6f"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54860,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "725875",
      "title": "The Data Dojo: A Power BI Community of Practice",
      "description": "One of the best ways to improve data literacy and foster an active, passionate data culture within an organization is to establish a \"Community of Practice\" around the technologies the organization uses to process, store, analyze, and consume data.\r\n\r\nIn this session, we'll learn about \"The Data Dojo: A Power BI Community of Practice,\" which was established at Des Moines University to facilitate the sharing of knowledge and experience among faculty and staff interested in analyzing the data generated by their teams and departments. \r\n\r\nWe'll also talk about the Data Dojo's egalitarian founding principles and unconventional structure, some of the topics we've covered at our workshops, what has gone right, what we could have done better, and what we're planning for the future.\r\n\r\nAnd finally, we'll discuss how you can encourage data literacy and foster a vibrant data culture within your organization by establishing a Data Dojo of your own!",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f07c08d2-ebfe-4a50-87ed-68154a8028b6"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54861,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "732399",
      "title": "Basketball Analytics Engine",
      "description": "A non programmers show and tell of an engine built for providing novel insight into the action on a basketball floor. Now we really get to see the value of who's out there playing. A college programmer who hasn't programmed in YEARs rolls his sleeves back up on a basketball related passion project. Go get some !",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "9ce0d8a6-9e26-438b-9d75-b6369ebbb85c"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54862,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "726313",
      "title": "Boot Security: Why the Hardware Root of Trust Matters",
      "description": "What is a hardware root of trust? Why is it important? What measure of security does a hardened host provide? These are some of the questions I hear when I bring up the topic of boot security. This talk is focused on how computers boot up and how technologies like Intel Secure Boot work. We will go over the boot process before the OS is executed and talk about some of the attacks that are possible at this stage and the impact such an attack can have on the entire platform. After this groundwork is complete, we will talk about how some of the different hardware root of trust technologies work to mitigate the risk posed by these types of attacks.  \r\n",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "1cacbbcc-84f5-4add-96b9-eee5449db9ca"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54863,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "733648",
      "title": "Debugging Burnout",
      "description": "Working in a product space requires knowing how to take a very complex problem and break it down into iterative chunks.  Far too often, we’re so wrapped up in the problems we’re solving professionally, that we completely forget to introspectively look at ourselves and ask what problems in our own lives need solving.  Burnout is real and worth addressing.  But much like the dev process, understanding the “why” behind behavior leads to a more sustainable outcome. We want to develop a framework and language to properly identify burnout and how we can work through it.  \r\n",
      "startsAt": "2024-10-26T15:30:00",
      "endsAt": "2024-10-26T16:30:00",
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "df992bbb-7d7a-4898-b2bf-252076fd9457"
      ],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 54864,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "8a1fd8a4-f333-4f80-8132-cdaf1f20a89f",
      "title": "Closing Session",
      "description": "Join us for a wrap up and some door prizes!",
      "startsAt": "2024-10-26T16:30:00",
      "endsAt": "2024-10-26T17:00:00",
      "isServiceSession": true,
      "isPlenumSession": true,
      "speakers": [],
      "categoryItems": [],
      "questionAnswers": [],
      "roomId": 51536,
      "liveUrl": null,
      "recordingUrl": null,
      "status": null,
      "isInformed": false,
      "isConfirmed": false
    }
  ],
  "speakers": [
    {
      "id": "0c4f74c9-6be8-40d0-b588-674d3b783472",
      "firstName": "Brian",
      "lastName": "Gorman",
      "bio": "Brian is a Microsoft Azure MVP and is an experienced speaker, author, trainer, and .NET developer with MCSA: Web App Certification, MCSD: App Builder, and eleven Azure certifications including Azure Developer, Administrator, DevOps, Architect, Data Administrator, Security, IoT, CosmosDB, and a number of Fundamentals certifications, and has been an MCT since April of 2019. Brian has a masters of science degree in computer information systems, and a bachelor of science degree in computer science. Additionally, Brian has around fifteen years of experience instructing college courses online in computer science, SQL databases, C#/VB.NET/and Java object-oriented programming, and Microsoft Office. Brian has created many online technical training courses that can be found online on various platforms. Brian has also published multiple books with APress, including \"Practical Entity Framework\" and the second edition \"Practical Entity Framework Core 6\".  Brian's latest book, Developing Solutions for Microsoft Azure Certification Companion: Hands-on Preparation and Practice for Exam AZ-204 was released in May of 2023.",
      "tagLine": "Microsoft Azure MVP, Speaker, Author, Trainer, and .Net Developer",
      "profilePicture": "https://sessionize.com/image/a37c-400o400o1-sVRrSNiPt7mLPSR5B51GZs.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        737186
      ],
      "fullName": "Brian Gorman",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a44c7b35-83ea-48a8-a305-fcfa160d5b76",
      "firstName": "Dustin",
      "lastName": "Thostenson",
      "bio": "Dustin Thostenson is an independent consultant, leading Delta3Consulting. He has been a developer, mentor, trainer and agile coach for decades. His passion lies in helping people grow and teams deliver. To keep it interesting he helps lead the Iowa .NET User Group and volunteers in Central Iowa. To keep it real he spends time with his wife and 4 kids. To keep it random he tweets @dustinson",
      "tagLine": "Understand, Be Understood",
      "profilePicture": "https://sessionize.com/image/493c-400o400o1-7SaX19cCdvLF3Dy9MMg5rp.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        729456
      ],
      "fullName": "Dustin Thostenson",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0cfc4167-0700-4bd3-9fa0-96bdbe335c3a",
      "firstName": "Emily",
      "lastName": "Harden",
      "bio": "Emily Harden is the Executive Director of the Techlahoma Foundation. She previously served as Techlahoma's first Community Manager, and prior to that worked in the property management industry. Besides Techlahoma, Emily is the Oklahoma Women in Tech Director of Partnerships and is involved in TYPROS Tech Crew. If she isn’t out representing Techlahoma and Json the Bson, she can be found playing board games, video games, traveling, or hanging out with her husband and two dogs.",
      "tagLine": "Executive Director, Techlahoma Foundation",
      "profilePicture": "https://sessionize.com/image/654a-400o400o1-VA5i2bVC5urNqjHURi82AG.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        751594
      ],
      "fullName": "Emily Harden",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8f39cbc1-7221-4c5e-a7e3-461e9e2a861d",
      "firstName": "Evan",
      "lastName": "Hennis",
      "bio": "Graduated from Iowa State in 2004 with a degree in Computer Science. Moved to Des Moines and has been doing .NET development ever since.\r\n\r\nIn 2016, I decided to test out Georgia Tech's online masters program and couldn't have been happier. I graduated Fall 2018 with a Master's in Computer Science with a machine learning specialization. Since that time I have gone on to get recognized as a Google Developer Expert in Machine Learning and given presentations to audiences all across the globe.\r\n\r\nCurrently, I am employed by Microsoft as a Software Engineer working in the Azure Active Directory Data Governance team.",
      "tagLine": "Senior Software Engineer",
      "profilePicture": "https://sessionize.com/image/953c-400o400o1-c1-7221-4c5e-a7e3-461e9e2a861d.6cd67246-0a61-4c88-8e82-5492e46cdbe2.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        729003
      ],
      "fullName": "Evan Hennis",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "bdc3c162-02ab-4e2b-a39b-00842eca922e",
      "firstName": "Grey",
      "lastName": "Lovelace",
      "bio": "Grey Lovelace is a Sr. Software Consultant at Source Allies. He is known for building reusable and resilient solutions in many industries, including insurance and agriculture. Grey has built APIs to integrate with hundreds of different use cases for over a decade, and has experienced first hand what works, and what doesn’t stand the test of time. He takes pride in designing sustainable architecture that can thrive in the real-world, where things do not always go as planned.  The last few years, Grey has been focused on the Generative AI space, and finding real solutions to real problems in a space that is often filled with more noise than substance.",
      "tagLine": "Source Allies, Senior Software Consultant",
      "profilePicture": "https://sessionize.com/image/3285-400o400o1-WRTVywaAgPHVzEXxe7D4mR.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        745828,
        745826
      ],
      "fullName": "Grey Lovelace",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "7867d515-dfea-4c6b-a113-b08481237c01",
      "firstName": "Heidi",
      "lastName": "Bedier",
      "bio": "Heidi Bedier, Director of Leadership Development\r\nParagon's Director of Leadership Development, Heidi Bedier, will facilitate the four-part series. Heidi has over 25 years of experience guiding leaders, teams and organizations through change management, leadership development and culture formation. She holds a Master of Science in Adult Learning, Performance and Development and is currently a PhD candidate pursuing her doctoral degree in Educational Leadership. She is a graduate of the Brain-Base Coaching Program with the NeuroLeadership and is a Ritz Carlton Service Excellence Culture Program Participant.\r\n",
      "tagLine": "Director of Leadership Development, Paragon IT Professionals",
      "profilePicture": "https://sessionize.com/image/b331-400o400o1-BbX428oATwbv8ABghASQeC.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        749675
      ],
      "fullName": "Heidi Bedier",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0b5eb7a9-187c-4b74-bfea-010c18b414f4",
      "firstName": "Iowa",
      "lastName": "Code Camp",
      "bio": "Iowa Code Camp is a free, one-day, in-person event for software developers interested in industry-specific topics, such as front-end JavaScript frameworks, IT cloud infrastructure, database architecture, and working with engineering teams.",
      "tagLine": "Iowa Code Camp Leadership",
      "profilePicture": null,
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        760604,
        763512
      ],
      "fullName": "Iowa Code Camp",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f07c08d2-ebfe-4a50-87ed-68154a8028b6",
      "firstName": "James",
      "lastName": "Bartlett",
      "bio": "James D. Bartlett III is a Microsoft MVP and Fabric Administrator/Senior Business Intelligence Analyst at Des Moines University in Iowa, USA. He started working in IT while he was a student in the Business Administration program at Colorado State University. After graduation, James dabbled in banking, real estate, healthcare, and even had a short stint as a resident DJ at Denver's top nightclub, before finally stumbling upon his true calling in the Business Intelligence field in 2018. James is a co-developer of the PowerBI.tips Business Ops app, co-organizer of the Higher Education Power BI and Iowa Power BI User Groups, a Microsoft Certified Fabric Analytics Engineer Associate (DP-600), and a Microsoft Certified Power BI Data Analyst Associate (PL-300). In his spare time, James enjoys contributing to open-source software projects, volunteering, longboarding, playing the guitar, and producing electronic music in his home studio.",
      "tagLine": "Senior Business Intelligence Analyst, Microsoft MVP",
      "profilePicture": "https://sessionize.com/image/b4f1-400o400o1-nsi7zAzMsQWCcxvWQzn6vN.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        725875
      ],
      "fullName": "James Bartlett",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8723a815-476d-41b4-bed8-c5d2b046bb9e",
      "firstName": "Jason",
      "lastName": "Bock",
      "bio": "Jason Bock is a Staff Software Engineer at Rocket Mortgage and a Microsoft MVP (C#). He has nearly 30 years of experience working on several business applications using a diverse set of frameworks and languages. He is the author of \".NET Development Using the Compiler API\", \"Metaprogramming in .NET\", and \"Applied .NET Attributes\". He has written numerous articles on software development issues and has presented at a number of conferences and user groups.",
      "tagLine": "Staff Software Engineer - Rocket Mortgage",
      "profilePicture": "https://sessionize.com/image/49f9-400o400o1-LwFBafHHMMVyyQK9vMXFpv.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        737426,
        737425
      ],
      "fullName": "Jason Bock",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "faa420ba-d649-4c20-a5ee-ec6586987b64",
      "firstName": "Jason",
      "lastName": "Logan",
      "bio": "I started as front-end developer writing re-usable component libraries right in Cedar Rapids.\r\nI learned a lot about leadership and myself with an outstanding opportunity at a local startup.\r\nI gained perspective at one of the Big 4 professional services firms as a Solutions Architect.\r\nNow I am back in Iowa working on an amazing team during a exciting growth phase.\r\nI love collaboration, problem solving, and being surrounded by people smarter than me. ",
      "tagLine": "CCR Technologies - Senior Developer / Solutions",
      "profilePicture": "https://sessionize.com/image/0b83-400o400o1-WzQ9if4tYixpUxvCbVCktG.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        741132
      ],
      "fullName": "Jason Logan",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "2ef2a9a7-1ab0-441c-bde7-fa73b04e9af4",
      "firstName": "Jeremiah",
      "lastName": "Evans",
      "bio": "Jeremiah is the Director of Research & Technology at Zirous, with a background in philosophy. With 15 years of experience in software engineering ranging from development and QA to microservices and big data, his current focus in AI includes considering the ethical and moral implications of implementing AI in software solutions that impact people - which is all software everywhere.",
      "tagLine": "Husband, Father, Philosopher, Director of Research and Technology at Zirous",
      "profilePicture": "https://sessionize.com/image/45ad-400o400o1-RnMAjxwEJeAXWa1izbQtJS.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        751880
      ],
      "fullName": "Jeremiah Evans",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "9ce0d8a6-9e26-438b-9d75-b6369ebbb85c",
      "firstName": "Jim",
      "lastName": "Goebel",
      "bio": "I used to program a long time ago. In college. I'm weird. Come see some goofiness. ",
      "tagLine": "Goof Troop Founder and Tall Dude ",
      "profilePicture": "https://sessionize.com/image/d066-400o400o1-3dPmsWGxUbxNjYpVjd885z.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        732399
      ],
      "fullName": "Jim Goebel",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "e775a168-09a5-4c35-8acc-8a5c995833e1",
      "firstName": "Joshua",
      "lastName": "Angolano",
      "bio": "Josh has been interested in computers since he was five years old.  He has worked professionally as a developer, engineer, director, and architect for over 20 years.   He considers himself a lifelong learner. He ​loves mentoring and working with others.  His passion is seeing others progress through their careers.\r\n\r\nJosh has led large product development initiatives for multiple financial services organizations.  This has included migrating from desktop applications to the web and from on-premise to the cloud. ",
      "tagLine": "Engineering Lead, Lean Techniques",
      "profilePicture": "https://sessionize.com/image/4f51-400o400o1-WeHRQRASdt26edpgjMQRCv.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        744833
      ],
      "fullName": "Joshua Angolano",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "21c089b2-3d1a-46a7-a6e5-c9cb394ec78f",
      "firstName": "Judah",
      "lastName": "De Paula",
      "bio": "Judah De Paula received his PhD in computer science from University of Texas at Austin. After a couple years working at Enthought, an open-source Python scientific computing company, Judah moved to Iowa and has now worked for fifteen years at Corteva Agrisicence in a variety of roles (including management) and is currently a Senior Software Architect coordinating new development while doing his part on the team to keep millions of lines of in-house code operational.",
      "tagLine": "Corteva Agriscience, Solution Architect",
      "profilePicture": "https://sessionize.com/image/de80-400o400o1-wGmiT17aCoDLq9pzSzvnzF.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        728119
      ],
      "fullName": "Judah De Paula",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "5cf66ded-35a5-4a1e-b6ac-eeefd78749fb",
      "firstName": "Kim",
      "lastName": "Knoll",
      "bio": "I've dedicated my career to IT recruitment! From the get-go, I've been deeply immersed in the industry, always eager to refine my skills and stay ahead of the curve.  I've placed hundreds of Information Technology individuals in the Greater Des Moines market since 1995.  \r\n\r\nI also believe in staying educated on my craft, and Joining professional groups has been a cornerstone of my career. Early on, I joined the National Association of Personnel Services (NAPS), a body dedicated to maintaining high standards in staffing. In 2001, it was a privilege to be welcomed into the Pinnacle Society, an exclusive group that celebrates recruiters for their excellence, ethics, and expertise.\r\n\r\nOutside of my professional life, I've been active in my local community, serving on the Board of Midland Credit Union to promote financial wellness. During my children's school years, I was a committed volunteer with the Parent-Teacher Association (PTA) and vocal music area, volunteering for numerous activities for over 16 years.\r\n\r\nAs I approach the coming years in the recruitment industry, I'm excited about the opportunity to continue positively impacting both candidates and organizations. It's been a fulfilling journey, and I look forward to the future, ready to embrace new challenges and opportunities with the same enthusiasm I've had from the start.",
      "tagLine": "Executive Resources Limited ",
      "profilePicture": "https://sessionize.com/image/7259-400o400o1-StkDirxnKfnhrLCAvADYHu.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        742274
      ],
      "fullName": "Kim Knoll",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "848de13d-1c85-4fbf-b627-1c94b80fafa1",
      "firstName": "Kyle",
      "lastName": "Hoehns",
      "bio": "Kyle is a seasoned Software Engineer with over a decade of experience in the development and implementation of complex software solutions. With a strong foundation in backend technologies like Java and Go, Kyle has consistently delivered high-quality, scalable, and efficient solutions across various industries. He is passionate about solving problems and believes in not taking himself too seriously. ",
      "tagLine": "Software Engineering Consultant and Teammate Pipeline Architect at Source Allies",
      "profilePicture": "https://sessionize.com/image/d8b1-400o400o1-4KjL1nEqgqMcvZMcWWwaCz.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        727187
      ],
      "fullName": "Kyle Hoehns",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "683ab952-4c52-4716-85d8-d4c92abb32c9",
      "firstName": "Lwin",
      "lastName": "Maung",
      "bio": "Meet Lwin Maung: A distinguished figure in the realm of technology and innovation. With a ten times Microsoft MVP title under his belt, Lwin boasts an unparalleled prowess in the field of mechatronics, accumulated through a remarkable span of over two and half decades as a trusted consultant.\r\n\r\nAn accomplished author, mentor, and sought-after technology advisor, Lwin has been a guiding force for numerous C-level executives within Fortune 100 companies. Together with his adept team of developers, he has spearheaded the creation of bespoke AI and IoT solutions, leaving an indelible mark on clients and end users across the globe. The solutions architected by Lwin have transcended boundaries, finding application in diverse corners of the world and enriching countless lives.\r\n\r\nLwin's influence extends even further, as evidenced by his instrumental role in crafting the IoT Core device manufacturing guide for Microsoft. His contributions have also left an imprint on the creation of various certification exams for the tech giant.\r\n\r\nBeyond the corporate sphere, Lwin's creativity and innovation shine. Collaborating with his brother Min, Lwin's mobile applications have garnered recognition on prominent technology platforms such as engadget, gizmodo, and pocket now. They have undertaken the design and production of programmable microcontrollers, as well as microcontroller-operated robots, tailored for educational purposes—empowering children and teenagers to grasp the fundamentals of programming.\r\n\r\nIn the spirit of paying it forward, Lwin dedicates his free time to instructing and mentoring high school and university students, nurturing the next generation of application developers and hardware pioneers. His commitment to harnessing the power of technology for the betterment of humanity remains steadfast and unyielding. An active luminary within the development community, Lwin is integral to the organization of the esteemed Chicago Code Camp. His influence reverberates across various technical conferences and code camps, where he regularly takes the stage to share his insights and expertise.\r\n\r\nLwin Maung embodies a relentless pursuit of new frontiers in technology, driven by a genuine passion for enhancing the human experience through innovation. Join him on his journey as he continues to shape the landscape of technology and its transformative potential.",
      "tagLine": "Microsoft MVP | Board Advisor | Digital Innovator | Speaker | Author",
      "profilePicture": "https://sessionize.com/image/db8e-400o400o1-3yiQe9ZDuufAusib3fC6ZG.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        741880,
        741885
      ],
      "fullName": "Lwin Maung",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f325ad0b-4ed5-4be4-83b5-63132f3332b9",
      "firstName": "Matt",
      "lastName": "Busche",
      "bio": "Software Engineer. Wheel of Fortune expert. Lover of spreadsheets. Graduate of the University of Northern Iowa.",
      "tagLine": "Software Engineer ",
      "profilePicture": "https://sessionize.com/image/d0fe-400o400o1-0b-4ed5-4be4-83b5-63132f3332b9.7ad49c99-6223-4d51-8630-d3c1abd1c766.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        734320,
        734321
      ],
      "fullName": "Matt Busche",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b0d25d6a-4236-44a5-8e9f-6e21b6e1a429",
      "firstName": "Matt",
      "lastName": "Phillips",
      "bio": "Lifelong learner. Interested in learning about technology and how to impact teams in a positive way.",
      "tagLine": "Tech Lead at Integrity",
      "profilePicture": "https://sessionize.com/image/af9c-400o400o1-sffRYAujZcKWJ4HfDa56Tp.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        770421
      ],
      "fullName": "Matt Phillips",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "c032ce0e-73a9-445b-a42d-a674d6912262",
      "firstName": "Michael",
      "lastName": "Liendo",
      "bio": "As a Senior Developer Advocate at AWS, I’ve had the opportunity to build applications, develop architectures, and speak around the world as a way to remain customer obsessed.\r\n\r\nSince my beginnings as a self-taught developer, I’ve been focused on simplifying complex scenarios so the barrier to entry becomes a door easily opened for new developers.",
      "tagLine": "Instructor/Consultant | Frontend and Serverless Cloud ",
      "profilePicture": "https://sessionize.com/image/fda0-400o400o1-GjEQ93fjZXbZSE6WdPaJ6h.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        750804
      ],
      "fullName": "Michael Liendo",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "1469bb32-408e-40f2-8c5b-707097144b32",
      "firstName": "Mike",
      "lastName": "Cole",
      "bio": "Mike Cole is a developer currently focusing on .NET working remotely from Cedar Falls, IA. He's been around the proverbial block in the IT profession and has a wide array of experience in many fields. He is incredibly lazy and is always looking for easier and more streamlined ways to solve everyday problems. His passions in life include his family, sarcastic memes, the outdoors, and always having the last word.",
      "tagLine": "Principal at Cole Consulting",
      "profilePicture": "https://sessionize.com/image/6a58-400o400o1-32-408e-40f2-8c5b-707097144b32.d313a7d7-82fd-45c4-8682-84ff3ba15796.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        725381
      ],
      "fullName": "Mike Cole",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "2e1fff2d-99b3-4225-943a-41135cd2d51c",
      "firstName": "Min",
      "lastName": "Maung",
      "bio": "Min is a versatile technical expert with extensive experience spanning IoT devices, multi-platform mobile development, and emerging technologies like AI. He has significantly influenced the transformation of numerous organizations and businesses in various capacities, including architect, director, and data scientist. Recognized as a Microsoft MVP, Min's tech proficiency extends across an array of devices, evidenced by his diverse collection of smartphones and gadgets. Displaying technological impartiality, he consistently explores mobile platforms like Android and even designs personalized microcontrollers for his robotics ventures. Beyond coding, Min channels his energy into constructing robots, steadily expanding his robotic repertoire. Catch him presenting at top-tier conferences like That Conference and CodeMash. On weekdays, his focus shifts to crafting innovative solutions in IoT, Cloud, and AI domains.",
      "tagLine": "Mentor, Technical Presenter, Data Scientist",
      "profilePicture": "https://sessionize.com/image/c109-400o400o1-YDWrakvdv5m3gYuK637ri6.jpeg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        741880,
        741885
      ],
      "fullName": "Min Maung",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a9011c65-6287-4529-ac91-56a8b9daa9a9",
      "firstName": "Mitchel",
      "lastName": "Sellers",
      "bio": "Mitchel Sellers is globally known as a 15-time Microsoft MVP, an ASPInsider, a DNN MVP, is an MCP (Microsoft .NET, ASP.NET and SQL Server), and CEO of IowaComputerGurus Inc. Sellers has a deep understanding of software development and when speaking focuses on proper architecture standards, performance, stability, security, and overall cost-effectiveness of delivered solutions. This message and his abilities resonate in the technical war room as well as the executive board room. \r\n\r\nMitchel is a prolific public speaker, presenting more than 400 sessions at user groups and conferences globally, such as DevUp, SDN, and Code PaLOUsa. Sellers has been the author of multiple books and a regular blogger on technology topics.\r\n\r\nWhen Mitchel is not working in technology, you will find him flying his airplane, teaching others how to fly, or spending time with his family He is also actively involved in the Open Source Community working diligently to further the movement. Find out more about Sellers at his website http://www.mitchelsellers.com.",
      "tagLine": "Flying Code Ninja!",
      "profilePicture": "https://sessionize.com/image/6de8-400o400o1-SGDx1owbbyMaz74g1KUGgJ.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        726384
      ],
      "fullName": "Mitchel Sellers",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "1cacbbcc-84f5-4add-96b9-eee5449db9ca",
      "firstName": "Nicholas",
      "lastName": "Starke",
      "bio": "Nick is a professional reverse engineer with a background in low level software analysis",
      "tagLine": "Reverse Engineer",
      "profilePicture": "https://sessionize.com/image/c621-400o400o1-Ld3TztvW5tmTBoKFDMEqhR.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        728760,
        726313
      ],
      "fullName": "Nicholas Starke",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8f19f63e-982b-477c-bcbe-16e99497d8ff",
      "firstName": "Raghavendra",
      "lastName": "Sreenivas Murthy",
      "bio": "Raghavendra Sreenivas Murthy is a seasoned Database Architect with over 20 years of experience in database management, cloud architecture, and big data solutions. A certified professional Oracle DBA with expertise in Exadata, Hadoop, Cassandra, OCI, and AWS, Raghav has demonstrated proficiency in a broad range of technologies and environments, including production support, UAT, and development.\r\nIn his current role as a Cloud and Database Architect, Raghav leads a team of 40+ professionals, overseeing Oracle product implementations across North America. His extensive experience includes designing, implementing, and maintaining high availability (HA) and maximum availability architecture (MAA) environments, migrating databases from on-premises to cloud infrastructure, and optimizing performance through Oracle Exadata benchmarking.\r\nRaghavendra is an expert in database migrations, having successfully executed complex cross-platform and data center migrations with near-zero downtime using Oracle GoldenGate. His technical acumen extends to handling large-scale transformations from RDBMS to big data platforms like Cassandra and Hadoop.\r\nThroughout his career, Raghavendra has been instrumental in implementing Azure Data Lake solutions for data science and analytics, as well as managing IT infrastructure projects that include architecture reviews, performance evaluations, and enterprise monitoring. His leadership and technical skills have been recognized through his successful management of both onsite and offshore teams, delivering innovative solutions to a global clientele.\r\nRaghavendra's contributions to the field are further evidenced by his publications and blogs, where he shares insights on Oracle GoldenGate replication and other advanced database topics. He holds several certifications, including AWS Certified Solutions Architect, Oracle Cloud Infrastructure Architect Professional, and Oracle Exadata Certified Expert.\r\n",
      "tagLine": "Consulting Member of Technical Staff - Architect at Oracle America Inc",
      "profilePicture": "https://sessionize.com/image/b8e0-400o400o1-XDvJbw861V9CtDUykd9a6u.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        746017
      ],
      "fullName": "Raghavendra Sreenivas Murthy",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "797d42f4-b284-45e7-b400-3f402b151e8b",
      "firstName": "Robert",
      "lastName": "Boedigheimer",
      "bio": "Robert Boedigheimer provides business solutions with web technologies. He is a Microsoft MVP, a Progress Champion (Fiddler), an ASPInsider, a Pluralsight author, and a 3rd degree black belt in Tae Kwon Do. Robert regularly speaks at national and international events.",
      "tagLine": "Senior Application Developer",
      "profilePicture": "https://sessionize.com/image/48b1-400o400o1-PQLd8gMKxfvFHtxQnivYjc.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        771289,
        747792
      ],
      "fullName": "Robert Boedigheimer",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "df992bbb-7d7a-4898-b2bf-252076fd9457",
      "firstName": "Samuel",
      "lastName": "Shaw",
      "bio": "Sam has been in the technology space professionally for seven years after dabbling as a developer while working in academia.  His spare time is spent trying new things or in the gym fighting.  Most recently the focus being Krav Maga and Kung Fu.",
      "tagLine": "Software Developery Stuffs",
      "profilePicture": "https://sessionize.com/image/2e41-400o400o1-ERgX1G4gadSQG1iq6QWuFh.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        733648
      ],
      "fullName": "Samuel Shaw",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8f9f5411-8e27-4c2f-bc01-fc682342c44c",
      "firstName": "Scott",
      "lastName": "Sauber",
      "bio": "Scott is a software consultant and primarily does web development using ASP.NET Core and JavaScript. His second passion behind web development is helping teams realize their potential through technical practices (such as CI/CD, IAC, TDD, etc.) and working more effectively (such as limiting WIP, visualizing work, etc). \r\n\r\nHe’s a Microsoft MVP, Friend of Redgate and co-organizes the Iowa .NET User Group. You can find Scott on Twitter @scottsauber or on his blog at scottsauber.com.",
      "tagLine": "Director of Engineering at Lean TECHniques Inc",
      "profilePicture": "https://sessionize.com/image/e7e2-400o400o1-11-8e27-4c2f-bc01-fc682342c44c.14b890fa-93df-4504-b4a2-7ed87cadf80e.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        725451,
        725453
      ],
      "fullName": "Scott Sauber",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a5afc603-5cf5-4828-85c4-082b4ffddc6f",
      "firstName": "Steve",
      "lastName": "Davis",
      "bio": "Please review my LI profile as it is relatively up-to-date. I have spoken at many engagements including EntreFEST, 1 Million Cups, and many UIowa and Kirkwood classes and seminars. I also taught a class, Business Innovations, at the Kirkwood Regional Center for 5 years prior to COVID. I am comfortable with large crowds and engaging with my audience. I think overall, I know how some of my more introverted peers can feel and know how to break through that and get them to participate.",
      "tagLine": "CEO and Co-founder of Bio::Neos, Inc.",
      "profilePicture": "https://sessionize.com/image/de13-400o400o1-sYhsw14XWQfWbSRADDiRWA.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        750848
      ],
      "fullName": "Steve Davis",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b1bd4d43-a244-4aab-95bb-92bcaf427ee4",
      "firstName": "Tim",
      "lastName": "Purdum",
      "bio": "Creator of GeoBlazor open-source .NET library, Senior Software Engineer and Engineering Manager at dymaptic. Full-stack .NET, Blazor, and GIS specialist.",
      "tagLine": "Engineering Manager and Senior Software Engineer at dymaptic",
      "profilePicture": "https://sessionize.com/image/b241-400o400o1-Ev39DNxjv35euDRzYjWvK.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        762313
      ],
      "fullName": "Tim Purdum",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b8f6af91-31e0-48b7-bbdd-850124972b07",
      "firstName": "Whitney",
      "lastName": "Lovelace",
      "bio": "Whitney Lovelace is a technology consultant specializing in strategy and  product delivery. She is passionate about using memorable and impactful communication techniques that lead to better project outcomes. \r\nWhitney has over a decade of technology and strategy experience that she uses to efficiently lead complex projects and help companies navigate large transformations. She has a Bachelor of Arts degree from Simpson College where she studied Mathematics and Economics and an MBA from Iowa State University with a specialization in Business Analytics. \r\n\r\nWhile her educational background has focused on using data to drive business decisions, she is adamant that data has little power when not accompanied by a compelling story. Whitney has spent years researching and honing communication and facilitation techniques that lead to better business outcomes and create engaging employee experiences. ",
      "tagLine": "Source Allies, Consultant - Strategy and Delivery",
      "profilePicture": "https://sessionize.com/image/eeeb-400o400o1-Ke9H1FRCpX612mLN1PUcKL.png",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        734769
      ],
      "fullName": "Whitney Lovelace",
      "categoryItems": [],
      "questionAnswers": []
    }
  ],
  "questions": [],
  "categories": [],
  "rooms": [
    {
      "id": 51536,
      "name": "Room 106 | Delta3Consulting",
      "sort": 0
    },
    {
      "id": 51537,
      "name": "Room 107 | Source Allies",
      "sort": 1
    },
    {
      "id": 51538,
      "name": "Room 108 | Innoventure",
      "sort": 2
    },
    {
      "id": 54860,
      "name": "Room 109 | Executive Resources",
      "sort": 4
    },
    {
      "id": 54861,
      "name": "Room 112 | Far Reach",
      "sort": 5
    },
    {
      "id": 54862,
      "name": "Room 113 | Cole Consulting",
      "sort": 6
    },
    {
      "id": 54863,
      "name": "Room 114 | Turnberry",
      "sort": 7
    },
    {
      "id": 54864,
      "name": "Room 115 | We Write Code",
      "sort": 8
    },
    {
      "id": 54943,
      "name": "Atrium",
      "sort": 9
    }
  ]
}